import React from 'react';
import '../../styles/about.css';

function AboutPage() {
    return (
        <div className="container">
            <section className="advantages">
                <div className="advantage advantage--first">
                    <h3>Широкий асортимент</h3>
                    <p>Ми пропонуємо не лише найкраще спортивне спорядження, але й товари, що відповідають останнім тенденціям у світі спорту.
                        <br />Від інноваційних до класичних, у нас є все для вашого активного способу життя.
                        <br />Незалежно від того, чи шукаєте ви професійне спорядження, чи просто хочете почати тренуватися, ви знайдете те, що вам підходить.</p>
                </div>

                <div className="advantage advantage--second">
                    <h3>Зручна доставка</h3>
                    <p>Ми цінуємо ваш час і прагнемо зробити процес покупки максимально комфортним. Завдяки нашій налагодженій логістиці ми швидко доставляємо замовлення по всій країні.<br />
                        Ви можете обрати найзручніший спосіб отримання товару – кур'єрську доставку, самовивіз або поштові служби.</p>
                </div>

                <div className="advantage advantage--third">
                    <h3>Гарантія якості</h3>
                    <p>Усі товари в нашому магазині ретельно відібрані та відповідають найвищим стандартам якості.<br />
                        Ми працюємо лише з офіційними постачальниками та перевіреними брендами (такими як Nike, Adidas, Puma та інші), <br />
                        тому ви можете бути впевнені в оригінальності та довговічності продукції.</p>
                </div>

                <div className="advantage advantage--fourth">
                    <h3>Підтримка</h3>
                    <p>Не знаєте, який продукт вам підійде? Наші консультанти – люди, які захоплені спортом і знають про нього толк. <br />
                        Ми допоможемо вам зробити правильний вибір відповідно до ваших потреб, рівня підготовки та бюджету.<br />
                        Ми прагнемо не лише продавати спортивне спорядження, а й допомогти вам досягти нових висот у спорті та активному житті. <br />
                        Дякуємо, що обрали MoveX!</p>
                </div>

                <div className="advantage advantage--fifth">
                    <h3>Контакти</h3>
                    <p><strong>Адреса:</strong> вул. Енергійна, 15, Київ, Україна</p>
                    <p><strong>Електронна пошта:</strong> movex_support@gmail.com</p>
                    <p><strong>Телефон:</strong> +38 (068) 654-32-10</p>
                    <p><strong>Години роботи:</strong> Пн-Сб: 9:00 - 19:00, Нд: вихідний</p>
                </div>
            </section>
        </div>
    );
}

export default AboutPage;